app/controllers/application_controller.rb

    def current_user
        # return the first user in the database
        @user =  User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]