app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.post_id = params[:post_id]

    if @comment.save
---
INSERT INTO "comments" ("text", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Testing it again\n"], ["author_id", 1], ["post_id", 7], ["created_at", "2022-12-02 15:04:32.502698"], ["updated_at", "2022-12-02 15:04:32.502698"]]

  def destroy
    @comment = Comment.find(params[:id])
    @post = Post.find(@comment.post_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]