app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # @user = User.includes(:posts).find(params[:id])
    @user = User.find(params[:id])